package smtcl.mocs.utils.device;
/**
 * 设备存放地图、坐标、图片
 * @version V1.0
 * @创建时间 2013-4-26
 * @作者 liguoqiang
 * @修改者
 * @修改日期
 * @修改说明
 */
public class MapXYM {
	/**
	 * 图片x轴坐标
	 */
	public static final  int[] BIGX={1800,1540,1790,2050,
	      1280,1530,1780,2040,2300,
	      1020,1270,1520,1770,2030,2290,2570,
	      760,1010,1260,1530,1800,2050,2290,2560,2840,
	      530,780,1030,1300,1570,1800,2020,2280,2540,2800,3080,
	      300,560,800,1050,1330,1560,1790,2000,2260,2520,2780,3040,3300,
	      3550,3290,3030,2770,2510,2250,2030};
	/**
	 * 图片y轴坐标
	 */
	public static final int[] BIGY={1950,1820,1660,1790,
	      1690,1530,1400,1530,1660,
	      1560,1400,1270,1100,1230,1370,1510,
	      1430,1270,1130,980,840,970,1100,1230,1370,
	      1320,1160,1010,870,720,580,700,830,960,1090,1230,
	      1200,1040,900,740,600,460,330,440,570,700,830,960,1090,
	      970,840,700,570,440,310,200};
	/**
	 * 状态图片
	 */
	public static String[] BIGSM={"images/yx.png","images/tj.png","images/zb.png","images/gz.png","images/kx.png"};

	/**
	 * 机床类型图片
	 */
	public static String[] BIGM={"images/jc.png","images/jc1.png","images/jc2.png","images/jc3.png"};
	 
	
}
